export interface Product {
  id: number;
  name: string;
  description: string;
  price: number;
  image: string;
  category: 'عبايات' | 'فساتين';
}

export const products: Product[] = [
  {
    id: 1,
    name: 'فستان ماكسي طويل بكسرات بلون أزرق فاتح',
    description: 'فستان ماكسي طويل بكسرات بلون أزرق فاتح،بأكمام طويلة منفوخة قليلاً مع معصمين مكشوفين وياقة عالية. يحيط حزام من نفس القماش بالخصربتصميم متواضع وأنيق، مناسب لمختلف المناسبات.',
    price: 47,
    image: '/images/fustan/fustan1.jpg?text=فستان+أزرق',
    category: 'فساتين'
  },
  {
    id: 2,
    name: 'عبايه خليجيه فاخره ثلاث قطع',
    description: 'عصرية أنيقة بتصميم مفتوح مع طرحة متناسقة، تتميز بألوان ترابية دافئة ونقوش فنية. مصنوعة من قماش مريح وعملي،',
    price: 44,
    image: '/images/Ibayat/ibaya1.jpg?text=عباية+خليجيه',
    category: 'عبايات'
  },
  {
    id: 3,
    name: 'فستان بيج فاتح (لون رملي)',
    description: 'فستان نسائي طويل بيج أنيق، بتصميم مطوي جذاب، وأكمام طويلة واسعة، يزدان بحزام خصر يبرز جمال القوام. مثالي للمناسبات الراقية والمحجبات',
    price: 47,
    image: '/images/fustan/fustan2.jpg?text=فستان+ بيج فاتح',
    category: 'فساتين'
  },
  {
    id: 4,
    name: 'فستان ماكسي أحمر داكن أنيق',
    description: 'فستان ماكسي أحمر داكن أنيق، يتميز بياقة عالية وأكمام منفوخة، مع حزام يحدد الخصر وتنورة بليسيه فضفاضة، مثالي لإطلالةراقية ومحتشمة .',
    price: 47,
    image: '/images/fustan/fustan3.jpg?text=فستان+صيفي',
    category: 'فساتين'
  },
  {
    id: 5,
    name: 'فستان شيفون طويل أنيق بقصة كلوش',
    description: 'فستان شيفون طويل أنيق بقصة كلوش، يتميز بطبعة ملونة زاهية تجمع بين الأزرق والوردي ودرجات الباستيل، مع أكمام طويلة',
    price: 47,
    image: '/images/fustan/fustan4.jpg?text=فستان+صيفي',
    category: 'فساتين'
  },
  {
    id: 6,
    name: 'عبايه خليجيه فاخره ثلاث قطع',
    description: 'عصرية أنيقة بتصميم مفتوح مع طرحة متناسقة، تتميز بألوان ترابية دافئة ونقوش فنية. مصنوعة من قماش مريح وعملي،',
    price: 44,
    image: '/images/Ibayat/ibaya2.jpg?text=عباية+خليجيه',
    category: 'عبايات'
  },
{
    id: 7,
    name: 'فستان شيفون طويل أنيق بقصة كلوش',
    description: 'فستان شيفون نسائي طويل باللون الوردي الناعم، يتميز بتصميم أنيق مع خصر محدد وأكمام منفوخة، وتنورة واسعة منسدلة. مثالي للمناسبات الراقية، يجمع بين الرقة والفخامة ليمنحك إطلالة ساحرة ومحتشمة',
    price: 47,
    image: '/images/fustan/fustan5.jpg?text=فستان+صيفي',
    category: 'فساتين'
  },
  {
    id: 8,
    name:'فستان أنيق بقطعتين: بلوزة زرقاء',
    description: 'إنه فستان أنيق بقطعتين: بلوزة زرقاء بأكمام طويلة وتصميم لف يبرز الخصر، مع تنورة بيضاء واسعة متعددة الطبقات مزينة بنقوش عصرية ملونة. مثالي لإطلالة أنثوية مميزة',
    price: 45,
    image: '/images/fustan/fustan6.jpg?text=فستان+صيفي',
    category: 'فساتين'
  },
   {
    id: 9,
    name:'فستان أنيق بقطعتين: بلوزة زرقاء',
    description: 'إنه فستان أنيق بقطعتين: بلوزة زرقاء بأكمام طويلة وتصميم لف يبرز الخصر، مع تنورة بيضاء واسعة متعددة الطبقات مزينة بنقوش عصرية ملونة. مثالي لإطلالة أنثوية مميزة',
    price: 50,
    image: '/images/fustan/fustan7.jpg?text=فستان+صيفي',
    category: 'فساتين'
  },
  {
    id: 10,
    name: 'عبايه خليجيه فاخره ثلاث قطع',
    description: 'عصرية أنيقة بتصميم مفتوح مع طرحة متناسقة، تتميز بألوان ترابية دافئة ونقوش فنية. مصنوعة من قماش مريح وعملي،',
    price: 44,
    image: '/images/Ibayat/ibaya4.jpg?text=عباية+خليجيه',
    category: 'عبايات'
  },
  {
    id: 11,
    name: 'عبايه خليجيه فاخره ثلاث قطع',
    description: 'عصرية أنيقة بتصميم مفتوح مع طرحة متناسقة، تتميز بألوان ترابية دافئة ونقوش فنية. مصنوعة من قماش مريح وعملي،',
    price: 44,
    image: '/images/Ibayat/ibaya5.jpg?text=عباية+خليجيه',
    category: 'عبايات'
  }
];